// 残件
//

//*****************************************************************************
//
// 【LM_sample.c】LM(ﾚｰﾍﾞﾝﾊﾞｰｸﾞ･ﾏﾙｶｰﾄ)法による最適化ｻﾝﾌﾟﾙﾌﾟﾛｸﾞﾗﾑ
//                ※Levenberg-Marquardt
//  void main()
//
//*****************************************************************************

#include <stdio.h>
#include <math.h>

#define NI  21 // ﾃﾞｰﾀ数
#define NM   6 // ﾊﾟﾗﾒｰﾀ数

/* ﾌﾟﾛﾄﾀｲﾌﾟ宣言 */
void  gsm( int, float[NM][NM+1] ); // ｶﾞｳｽ･ｻｲﾃﾞﾙ法による連立1次方程式の解法

int main()
{
/*********************************************************************************/
/*  【ｻﾝﾌﾟﾙﾃﾞｰﾀ】                                                                */
/*    y = 0.1458 x^5 -2.7604 x^4 + 13.542 x^3 + 6.0417 x^2 - 106.50 x + 180.00   */
/*********************************************************************************/
  float x[NI] =
          {   0.00f,   0.50f,   1.00f,   1.50f,   2.00f,   2.50f,   3.00f,   3.50f,
              4.00f,   4.50f,   5.00f,   5.50f,   6.00f,   6.50f,   7.00f,   7.50f,
              8.00f,   8.50f,   9.00f,   9.50f,  10.00f };
  float y[NI] =
          { 180.00f, 129.79f,  90.47f,  66.68f,  60.00f,  69.51f,  92.35f, 124.22f,
            159.99f, 194.21f, 221.67f, 237.91f, 239.84f, 226.20f, 198.19f, 159.95f,
            119.15f,  87.51f,  81.36f, 122.18f, 237.17f };

  /* 初期ﾊﾟﾗﾒｰﾀ ※z≠0 (摂動量算出に乗算を使用しているため) */
  float z[NM] = {  0.001f,  0.001f,  0.001f,  0.001f,  0.001f,  0.001f };

  int   i;           // ｻﾝﾌﾟﾙﾃﾞｰﾀの添字
  int   j, j1, j2;   // ﾊﾟﾗﾒｰﾀの添字
  int   k;           // ﾊﾟﾗﾒｰﾀ更新回数

  float dz;          // ﾊﾟﾗﾒｰﾀ摂動量
  float fzx[NI];     // ﾊﾟﾗﾒｰﾀ摂動なしでの「f(z)」
  float ram;         // 減衰係数λ(λ＞0)

  float fz[NI];      // 実績計算値

  float A[NM][NM+1]; // 行列
  float Jz[NI][NM];  // 勾配ﾍﾞｸﾄﾙ(ﾔｺﾋﾞｱﾝ) J(z)
  float JzT[NI][NM]; // 転置ﾔｺﾋﾞｱﾝ J(z)T

  float s1, s2;      // 精度算出用変数
  float ave;         // 偏差平均
  float sig;         // 偏差σ
  float rmse;        // 偏差RMSE

/**************************************************************************/
/*  ram : 減衰係数 λ＞0                                                  */
/*    更新で偏差が減少する場合はλを小さくし、減少しない場合は大きくする  */
/*     λ 小 : ｶﾞｳｽ･ﾆｭｰﾄﾝ法に近づき、更新幅大                             */
/*     λ 大 : 最急降下法に近づき、更新幅小                               */
/**************************************************************************/
  ram =  10.0f; // λは暫定値として 10.0 とした

  ////////////////////////////////////////////////////////////////////////////////
  //  更新回数ﾙｰﾌﾟ
  ////////////////////////////////////////////////////////////////////////////////
  for ( k=0; k<1000; k++ ) { // ﾊﾟﾗﾒｰﾀ更新回数 1000回ﾙｰﾌﾟ

    ////////////////////////////////////////////////////////////////////////////////
    //  ﾊﾟﾗﾒｰﾀ数＋2回ﾙｰﾌﾟ
    //    j = 0:       摂動なし「f(z)」算出(＋精度算出) ※精度算出は更新初回のみ
    //      = 1～NM-1: 摂動あり「f(z)」算出
    //      = NM:      摂動あり「f(z)」算出＋ﾊﾟﾗﾒｰﾀ更新
    //      = NM+1:    ﾊﾟﾗﾒｰﾀ更新後「f(z)」算出＋精度算出
    ////////////////////////////////////////////////////////////////////////////////
    for ( j=0; j<NM+2; j++ ) { // ﾊﾟﾗﾒｰﾀ数 NM+2回ﾙｰﾌﾟ

      /* ﾊﾟﾗﾒｰﾀ摂動(摂動量は調整が必要) */
      if ( (j >= 1) && (j <= NM) ) { /* j=0, j=NM+1 は摂動なし */
        dz     = 0.005f * z[j-1]; // 摂動量は暫定値として、ﾊﾟﾗﾒｰﾀの 0.5% とした
        z[j-1] = z[j-1] + dz;
      }

      ////////////////////////////////////////////////////////////////////////////////
      //  ﾃﾞｰﾀ数ﾙｰﾌﾟ
      ////////////////////////////////////////////////////////////////////////////////
      for ( i=0; i<NI; i++ ) { // ｻﾝﾌﾟﾙﾃﾞｰﾀ回数

        /***************/
        /*  f(z) 算出  */
        /***************/
        fz[i] =  z[0] * powf( x[i], 5.0f )
               + z[1] * powf( x[i], 4.0f )
               + z[2] * powf( x[i], 3.0f )
               + z[3] * powf( x[i], 2.0f )
               + z[4] *       x[i]
               + z[5];

        /****************************/
        /*  勾配ﾍﾞｸﾄﾙ(ﾔｺﾋﾞｱﾝ) 算出  */
        /****************************/
        if ( (j >= 1) && (j <= NM) ) { /* 摂動あり */
          Jz[i][j-1] = ( fz[i] - fzx[i] ) / dz;
        }
        else { /* 摂動なし */
          fzx[i] = fz[i];
        }

      } // for(i) ﾃﾞｰﾀ数ﾙｰﾌﾟ
      ////////////////////////////////////////////////////////////////////////////////

      /* ﾊﾟﾗﾒｰﾀ復元(摂動分を差し引く) */
      if ( (j >= 1) && (j <= NM) ) { /* 摂動あり */
        z[j-1] = z[j-1] - dz;
      }

      ////////////////////////////////////////////////////////////////////////////////
      //  ﾊﾟﾗﾒｰﾀ更新、精度評価
      ////////////////////////////////////////////////////////////////////////////////
      if ( j == NM ) { /* 全ﾊﾟﾗﾒｰﾀの勾配ﾍﾞｸﾄﾙ(ﾔｺﾋﾞｱﾝ)算出完了 */
        /**********************************/
        /*  ﾊﾟﾗﾒｰﾀ更新処理(LM法ｱﾙｺﾞﾘｽﾞﾑ)  */
        /**********************************/

        /* 初期化 */
        for ( j1=0; j1<NM; j1++ ) { for ( j2=0; j2<NM+1; j2++ ) {
          A[j1][j2] = 0.0f;
        } }

        /* 転置ﾔｺﾋﾞｱﾝ J(z)T */
        for ( i=0; i<NI; i++ ) { for ( j1=0; j1<NM; j1++ ) {
          JzT[i][j1] = Jz[i][j1];
        } }

        /* 行列計算 */
        for ( i=0; i<NI; i++ ) { // ﾃﾞｰﾀ数ﾙｰﾌﾟ
          for ( j1=0; j1<NM;  j1++ ) {

            for ( j2=0; j2<NM;  j2++ ) {

              /* J(z)T・J(z) 算出 */
              A[j1][j2] = A[j1][j2] + JzT[i][j1] * Jz[i][j2];

            } // for(j2)

            /* J(z)T・(y-f(z)) 算出 */
            A[j1][NM] = A[j1][NM] + JzT[i][j1] * ( y[i] - fz[i] );

          } // for(j1)
        } // for(i) ﾃﾞｰﾀ数ﾙｰﾌﾟ

        /* +λI 算出 */
        for ( j1=0; j1<NM; j1++ ) { A[j1][j1] = A[j1][j1] + ram; }

        /* 連立１次方程式を解く */
        gsm ( NM, A );

        /* ﾊﾟﾗﾒｰﾀ更新 */
        for ( j1=0; j1<NM; j1++ ) { z[j1] = z[j1] + A[j1][NM]; }

      }
      else if ( (j==0 && k==0) || (j==NM+1) ) { /* 初回の更新前 or ﾊﾟﾗﾒｰﾀ更新完了 */
        /********************************/
        /*  平均, 標準偏差, RMSE 算出)  */
        /********************************/
        s1 = 0.0f;
        s2 = 0.0f;
        for ( i=0; i<NI; i++ ) {
          s1 = s1 + ( fz[i]-y[i] );
          s2 = s2 + powf( fz[i]-y[i], 2 );
        }
        ave  = s1 / NI;                                      // 平均
        sig  = sqrtf( ((NI*s2)-powf(s1, 2)) / powf(NI, 2) ); // 標準偏差
        rmse = sqrtf( s2 / NI );                             // RMSE

        /*************************/
        /*  評価値、ﾊﾟﾗﾒｰﾀ 出力  */
        /*************************/
        if ( k==0 && j==0 ) {
          printf( " 更新,    平均,      σ,    RMSE,      ﾊﾟﾗﾒｰﾀ 1～6\n" );
          printf( "   前,%8.2f,%8.2f,%8.2f,  ", ave, sig, rmse );
        }
        else {
          printf( " %4d,%8.2f,%8.2f,%8.2f,  ", k+1, ave, sig, rmse );
        }
        for ( j1=0; j1<NM; j1++ ) { printf( "%10.4f,",z[j1] ); }
        printf( "\n" );

      } // if(j) ﾊﾟﾗﾒｰﾀ更新、精度評価
      ////////////////////////////////////////////////////////////////////////////////

    } // for(j) ﾊﾟﾗﾒｰﾀ数＋2回ﾙｰﾌﾟ
    ////////////////////////////////////////////////////////////////////////////////

  } // for(k) ﾊﾟﾗﾒｰﾀ更新回数ﾙｰﾌﾟ
  ////////////////////////////////////////////////////////////////////////////////

  return 0;
}

/************************************************/
/*                                              */
/*  ｶﾞｳｽ･ｻｲﾃﾞﾙ法による連立1次方程式の解法       */
/*                                              */
/*    A(i,j) X(i) = Y(i)                        */
/*                                              */
/*    [入力]                                    */
/*      n      : n元連立１次方程式の"n"         */
/*      a(i,j) : A(i,j) (i=0～n-1),(j=0～n-1)   */
/*      a(i,n) : Y(i)   (i=0～n-1)              */
/*    [出力]                                    */
/*      a(i,n) : X(i)   (i=0～n-1)              */
/*                                              */
/************************************************/
void gsm ( int n, float a[NM][NM+1] )
{
  int   i, j, k;
  float b, c;

  for ( k=0; k<n; k++ ) {
    c = a[k][k];
    for ( j=k; j<=n; j++ ) {
      a[k][j] = a[k][j] / c;
    }
    for ( i=0; i<n; i++ ) {
      if ( i != k ) {
        b = a[i][k];
        for ( j=k; j<=n; j++ ) {
          a[i][j] = a[i][j] - a[k][j] * b;
        }
      }
    }
  }

  return;
}
