//*****************************************************************************
//
// 【PSO_sample.c】PSO(粒子群最適化法)による最適化ｻﾝﾌﾟﾙﾌﾟﾛｸﾞﾗﾑ
//                 ※Particle Swarm Optimization
//  int main(void) … 参照用に C 標準準拠に変更
//
//*****************************************************************************

#include <stdio.h>
#include <math.h>
#include <stdlib.h>

#define NI   21 // ﾃﾞｰﾀ数
#define NM    6 // ﾊﾟﾗﾒｰﾀ数
#define NR  500 // 粒子数

int main(void)
{
/*********************************************************************************/
/*  【ｻﾝﾌﾟﾙﾃﾞｰﾀ】                                                                */
/*    y = 0.1458 x^5 -2.7604 x^4 + 13.542 x^3 + 6.0417 x^2 - 106.50 x + 180.00   */
/*********************************************************************************/
  float x[NI] =
          {   0.00f,   0.50f,   1.00f,   1.50f,   2.00f,   2.50f,   3.00f,   3.50f,
              4.00f,   4.50f,   5.00f,   5.50f,   6.00f,   6.50f,   7.00f,   7.50f,
              8.00f,   8.50f,   9.00f,   9.50f,  10.00f };
  float y[NI] =
          { 180.00f, 129.79f,  90.47f,  66.68f,  60.00f,  69.51f,  92.35f, 124.22f,
            159.99f, 194.21f, 221.67f, 237.91f, 239.84f, 226.20f, 198.19f, 159.95f,
            119.15f,  87.51f,  81.36f, 122.18f, 237.17f };

  /* 各ﾊﾟﾗﾒｰﾀに対する、初期粒子生成範囲の設定 */
  float zmin[NM] = {  -0.1f,  -0.1f,  -0.1f,  -0.1f,  -0.1f,  -0.1f };
  float zmax[NM] = {   0.1f,   0.1f,   0.1f,   0.1f,   0.1f,   0.1f };

  int   i;            // ｻﾝﾌﾟﾙﾃﾞｰﾀの添字
  int   ir, irx;      // 粒子の添字
  int   j;            // ﾊﾟﾗﾒｰﾀの添字
  int   k;            // ﾊﾟﾗﾒｰﾀ更新回数
  int   kmax = 1000;  // 更新回数

  float rnm1, rnm2;   // 乱数値[0,1]

  float z[NM];        // ﾊﾟﾗﾒｰﾀ
  float zr[NM][NR];   // 各粒子の位置＝ﾊﾟﾗﾒｰﾀ値
  float zrpb[NM][NR]; // ﾊﾟｰｿﾅﾙﾍﾞｽﾄ粒子の位置(更新回数内のﾍﾞｽﾄ)
  float zgb[NM];      // ｸﾞﾛｰﾊﾞﾙﾍﾞｽﾄ粒子の位置(更新回数内、各粒子内のﾍﾞｽﾄ)
  float v[NM][NR];    // 各粒子の更新時移動速度

  float fz[NI];       // 実績計算値

  float szmn;         // 最小評価値
  float szbt;         // best評価値
  float sz[NR]   = { 0.0f }; // 各粒子の評価値
  float szpb[NR] = { 0.0f }; // ﾊﾟｰｿﾅﾙﾍﾞｽﾄ粒子の評価値

  float w[NM];        // PSO 慣性 重み
  float c1[NM];       // PSO ﾊﾟｰｿﾅﾙﾍﾞｽﾄ 重み
  float c2[NM];       // PSO ｸﾞﾛｰﾊﾞﾙﾍﾞｽﾄ 重み

  float s1, s2;       // 精度算出用変数
  float ave[NR];      // 偏差平均
  float sig[NR];      // 偏差σ
  float rmse[NR];     // 偏差RMSE
  float bave;         // ﾍﾞｽﾄ 偏差平均
  float bsig;         // ﾍﾞｽﾄ 偏差σ
  float brmse;        // ﾍﾞｽﾄ 偏差RMSE

  /**********************************************************/
  /*  各粒子の初期位置、移動速度の初期値、PSOﾊﾟﾗﾒｰﾀ の設定  */
  /**********************************************************/
  srand( 0u ); // 乱数の種を初期化

  for ( j=0; j<NM; j++ ) { // ﾊﾟﾗﾒｰﾀﾙｰﾌﾟ
    for ( ir=0; ir<NR; ir++ ) { // 粒子数ﾙｰﾌﾟ

      rnm1 = (float)rand() / RAND_MAX; // [0,1]乱数

      /* ﾊﾟﾗﾒｰﾀ初期値は最小～最大の範囲内に乱数で設定、速度はｾﾞﾛ */
      zr[j][ir] = rnm1 * ( zmax[j]-zmin[j] ) + zmin[j];
      v[j][ir]  = 0.0f;
        
    } // for(ir)

    /* PSOﾊﾟﾗﾒｰﾀ c1, c2 設定 */
    c1[j] = 2.00f; // ﾊﾟｰｿﾅﾙﾍﾞｽﾄ  ※値は暫定値
    c2[j] = 0.80f; // ｸﾞﾛｰﾊﾞﾙﾍﾞｽﾄ ※値は暫定値

  } // for(j)

  ////////////////////////////////////////////////////////////////////////////////
  //  更新回数ﾙｰﾌﾟ
  ////////////////////////////////////////////////////////////////////////////////
  for ( k=0; k<kmax; k++ ) { // ﾊﾟﾗﾒｰﾀ更新ﾙｰﾌﾟ

    /* PSOﾊﾟﾗﾒｰﾀ w */ // 乱数設定の方が収束性が良い
    for ( j=0; j<NM; j++ ) { rnm1 = (float)rand() / RAND_MAX;
                             w[j] = rnm1 * 0.10f + 0.70f; } // 慣性 ※値は暫定値

    ////////////////////////////////////////////////////////////////////////////////
    //  粒子数ﾙｰﾌﾟ
    ////////////////////////////////////////////////////////////////////////////////
    for ( ir=0; ir<NR; ir++ ) { // 粒子数ﾙｰﾌﾟ

      /* 各粒子のﾊﾟﾗﾒｰﾀ設定 */
      for ( j=0; j<NM; j++ ) { z[j] = zr[j][ir]; }

      ////////////////////////////////////////////////////////////////////////////////
      //  ﾃﾞｰﾀ数ﾙｰﾌﾟ
      ////////////////////////////////////////////////////////////////////////////////
      for ( i=0; i<NI; i++ ) { // ｻﾝﾌﾟﾙﾃﾞｰﾀ回数

        /***************/
        /*  f(z) 算出  */
        /***************/
        fz[i] =  z[0] * powf( x[i], 5.0f )
               + z[1] * powf( x[i], 4.0f )
               + z[2] * powf( x[i], 3.0f )
               + z[3] * powf( x[i], 2.0f )
               + z[4] *       x[i]
               + z[5];

      } // for(i) ｻﾝﾌﾟﾙﾃﾞｰﾀ回数
      ////////////////////////////////////////////////////////////////////////////////

      /*******************************/
      /*  平均, 標準偏差, RMSE 算出  */
      /*******************************/
      s1 = 0.0f;
      s2 = 0.0f;
      for ( i=0; i<NI; i++ ) {
        s1 = s1 + ( fz[i]-y[i] );
        s2 = s2 + powf( fz[i]-y[i], 2 );
      }
      ave[ir]  = s1 / NI;                                      // 平均
      sig[ir]  = sqrtf( ((NI*s2)-powf(s1, 2)) / powf(NI, 2) ); // 標準偏差
      rmse[ir] = sqrtf( s2 / NI );                             // RMSE

      /* 評価対象を偏差RMSEとする */
      sz[ir] = rmse[ir];

      /* best評価値の初期値 */
      if ( k==0 && ir==0 ) { szbt = sz[ir]; }

      /***************************/
      /*  ﾊﾟｰｿﾅﾙﾍﾞｽﾄの導出,更新  */
      /***************************/
      if ( (k == 0) || (sz[ir] < szpb[ir]) ) { /* 更新初回 or 評価値良 */

        /* ﾊﾟｰｿﾅﾙﾍﾞｽﾄ評価値更新 */
        szpb[ir] = sz[ir];

        /* ﾊﾟｰｿﾅﾙﾍﾞｽﾄ粒子位置更新 */
        for ( j=0; j<NM; j++ ) { zrpb[j][ir] = zr[j][ir]; }
      }

    } // for(ir) 粒子数ﾙｰﾌﾟ
    ////////////////////////////////////////////////////////////////////////////////

    /*************************************************/
    /*  ｸﾞﾛｰﾊﾞﾙﾍﾞｽﾄ(ﾊﾟｰｿﾅﾙﾍﾞｽﾄの最良)の粒子位置算出  */
    /*************************************************/
    irx = 0;
    szmn = szpb[irx];
    for ( ir=1; ir<NR; ir++ ) { // 粒子数ﾙｰﾌﾟ
      if ( szpb[ir] < szmn ) { irx  = ir;         // ﾍﾞｽﾄ粒子のﾎﾟｲﾝﾀ
                               szmn = szpb[ir]; } // ﾍﾞｽﾄ粒子の評価値
    } // for(ir)

    /* ｸﾞﾛｰﾊﾞﾙﾍﾞｽﾄ粒子位置 */
    for ( j=0; j<NM; j++ ) { zgb[j] = zrpb[j][irx]; }

    /************************************/
    /*  初回と評価値更新時に出力値設定  */
    /************************************/
    if ( k==0 || szmn<szbt ) { szbt  = szmn;
                               bave  = ave[irx];
                               bsig  = sig[irx];
                               brmse = rmse[irx]; }

    /*************************/
    /*  評価値、ﾊﾟﾗﾒｰﾀ 出力  */
    /*************************/
    if ( k==0 ) {
      printf( " 更新,    平均,      σ,    RMSE,      ﾊﾟﾗﾒｰﾀ 1～6\n" );
    }
    printf( " %4d,%8.2f,%8.2f,%8.2f,  ", k+1, bave, bsig, brmse );
    for ( j=0; j<NM; j++ ) { printf( "%10.4f,",zgb[j] ); }
    printf( "\n" );

    /*********************************/
    /*  各粒子の移動速度、位置 更新  */
    /*********************************/
    srand( k ); // 乱数の種を更新回数で初期化

    for ( ir=0; ir<NR; ir++ ) {

      rnm1 = (float)rand() / RAND_MAX;  // 乱数1
      rnm2 = (float)rand() / RAND_MAX;  // 乱数2

      /* 各粒子の移動速度算出 */
      for ( j=0; j<NM; j++ ) {
        v[j][ir] =  w[j]  * v[j][ir]
                  + c1[j] * rnm1 * ( zrpb[j][ir] - zr[j][ir] )
                  + c2[j] * rnm2 * ( zgb[j]      - zr[j][ir] );
      } // for(j)

      /* 各粒子の位置を更新 */
      for ( j=0; j<NM; j++ ) { zr[j][ir] = zr[j][ir] + v[j][ir]; }

    } // for(ir)

  } // for(k) ﾊﾟﾗﾒｰﾀ更新ﾙｰﾌﾟ
  ////////////////////////////////////////////////////////////////////////////////

  return 0;
}
